# TransferMode Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
DataTransferProgressChangedEventArgs..::..TransferMode Property
DataTransferProgressChangedEventArgs Class See Also
---
Data transfer mode in this event.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017 Subscription Update
# Syntax
C#
---
```text
public DataTransferMode TransferMode { get; }
```

Visual Basic
---
```text
Public ReadOnly Property TransferMode As DataTransferMode
	Get
```

Visual C++
---
```text
public:
property DataTransferMode TransferMode {
	DataTransferMode get ();
}
```

# See Also
DataTransferProgressChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace